# Terraform environment at22
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_user_assigned_identity.admin: Reading...
data.azurerm_subnet.default: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at22/subnets/Default]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at22/subnets/Postgres]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.postgres: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at22]
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Storage/storageAccounts/staltinnauth001at22]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at22]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "db-psqlsrvaltinnauthregister001at22-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "db-psqlsrvaltinnauthregister001at22-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database will be created
  + resource "null_resource" "bootstrap_database" {
      + id       = (known after apply)
      + triggers = {
          + "kv_name"               = "kvregaltinnauth001at22"
          + "kv_resource_group"     = "rgaltinnauthregister001at22"
          + "kv_subscription"       = "37bac63a-b964-46b2-8de8-ba93c432ea1f"
          + "server_name"           = "psqlsrvaltinnauthregister001at22"
          + "server_resource_group" = "rgaltinnauthregister001at22"
          + "server_subscription"   = "37bac63a-b964-46b2-8de8-ba93c432ea1f"
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_at22_register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:AppConnectionString_at22_register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_at22_register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:MigrationConnectionString_at22_register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvregaltinnauth001at22"
      + public_network_access_enabled = false
      + purge_protection_enabled      = false
      + resource_group_name           = "rgaltinnauthregister001at22"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvkvregaltinnauth001at22"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepkvregaltinnauth001at22"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauthregister001at22"
      + subnet_id                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at22/subnets/Default"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.vaultcore.azure.net"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvregaltinnauth001at22"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["grant_pgsqlrv_app_contributor"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "grant_pgsqlrv_app_contributor"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["grant_register_app_reader"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "grant_register_app_reader"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at22/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at22_altinn.register.tfstate.tfplan`